coskunergan/isinem_kontrol/src/stm32l1xx_lcd_ST7522.c
/**
  ******************************************************************************
  * @file    stm32l1xx_lcd_ST7522.c
  * @author  Coskun ERGAN
  * @version V1.0.3
  * @date    12-Ekim-2012
  * @brief   ST7522 Çipsetli Glcd Kütüpanesi
  *
	*  @verbatim
  ******************************************************************************
	*   Notlar;
	*
	*		- Bu kütüpane Delay Fonksiyonunu kullanir Systick ile "DelayMs(100);"
	*			karsiligi 100Ms ye kurulmalidir.
	*		- GPIO tan1mlamalarini kendisi yapar portlara clock verir.(ULP için dikkate aliniz).
	*		- Bu kütüpanede CS1 pini kullanilmaz.
	*		    CS1: bu pin çip seçimini yapar tek çip oldugu icin sürekli "0" da tutulmalidir.
	*				     Kart üzerinden pin GND'ye Baglanmalidir.
	*
	*
	******************************************************************************
	*
	*    Kullanmadan önce sirasiyla;
	*
	*				Lcd_Pin_Init();  // lcd için gerekli pin,port,clk tanimlamalarini yapar.
	*				Init_Lcd();      // lcd kurulumunu yapar eger sonrasinda Lcd_Str fonksiyonu kullanilacak ise
	*														bu fonksiyon atlanabilir Lcd_Str icerisinde de init_lcd mevcuttur.
	*				Lcd_Str (Alt1,"Merhaba");		// glcd ye string gönderir ve ikonlari düzenler.
	*				Display_String_Yaz ("123456");		// Display bölümüne string gönderir.
	*				Ikon_Durum(Ikaz_Ikon,Yak);  / ekrandaki ikonlar1 yakar söndürür.
	*				Lcd_Clear(Alt_Ekran_2Satir,Alt_Ekran_Baslangic,Alt_Ekran_Bitis); // girilen adres degerlerinin
	*																																						arasindaki pixelleri siler.
  *  kisayol tr: isgöçü ISGÖÇÜ
	*	 kisayol BL: GPIO_ResetBits(Lcd_BL_Port,Lcd_BL_Pin);
	******************************************************************************
	*@endverbatim
	*****************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32l1xx_lcd_ST7522.h"
#include "stm32l1xx_lcd_tablo.h"

/** @addtogroup
  * @{
  */
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

uint16_t Battery;

//------------------------------------------------------------------------------
//  LCD'nin Test modu
//------------------------------------------------------------------------------
void Lcd_Test(void)
{
    uint8_t j;
    uint8_t send_segment, segment = Ust_Ekran_Baslangic;

    if(GPIO_ReadOutputDataBit(Lcd_Enb_Port, Lcd_Enb_Pin)) // Lcd On konumunda degil ise Lcd yi aç
    {
        Lcd_Init();
        Komut_Gon(0xAF);    // LCD On komutu
        GPIO_ResetBits(Lcd_BL_Port, Lcd_BL_Pin);        //  Backlight aktif
    }

    Display_String_Yaz("888888");

    Ikon_Durum(PilIc1_Ikon, Yak);
    Ikon_Durum(PilIc2_Ikon, Yak);
    Ikon_Durum(PilIc3_Ikon, Yak);
    Ikon_Durum(PilDis_Ikon, Yak);
    Ikon_Durum(Nokta1_Ikon, Yak);
    Ikon_Durum(Nokta2_Ikon, Yak);
    Ikon_Durum(Anahtar_Ikon, Yak);
    Ikon_Durum(Vana_Ikon, Yak);

    Ikon_Durum(TL_Ikon, Yak);
    Ikon_Durum(M3_Ikon, Yak);
    Ikon_Durum(Cizgi_Ikon, Yak);
    Ikon_Durum(Ikaz_Ikon, Yak);

    Komut_Gon(Ust_Ekran);
    send_segment = (segment & 0x0F);
    Komut_Gon(send_segment);           // segment adreslerini gonder
    send_segment = (segment & 0xF0);
    send_segment >>= 4;
    send_segment |= 0x10;
    Komut_Gon(send_segment);

    for(j = 0; j < 96; j++)
    {
        Veri_Gon(0, 0xFF);
    }

    Komut_Gon(Alt_Ekran_2Satir);
    send_segment = (segment & 0x0F);
    Komut_Gon(send_segment);           // segment adreslerini gonder
    send_segment = (segment & 0xF0);
    send_segment >>= 4;
    send_segment |= 0x10;
    Komut_Gon(send_segment);

    for(j = 0; j < 96; j++)
    {
        Veri_Gon(0, 0xFF);
    }

}
//------------------------------------------------------------------------------
//  LCD'nin Pinlerinin low power moda sokuldugu alt program
//------------------------------------------------------------------------------
void Lcd_Lp_Off(void)
{
    Lcd_Enb_Port->BSRRL = Lcd_Enb_Pin;
    Lcd_BL_Port->BSRRL = Lcd_BL_Pin;

    Lcd_Si_Port->BSRRH = Lcd_Si_Pin;
    Lcd_Scl_Port->BSRRH = Lcd_Scl_Pin;
    Lcd_A0_Port->BSRRH = Lcd_A0_Pin;
    Lcd_Rst_Port->BSRRH = Lcd_Rst_Pin;
}
//------------------------------------------------------------------------------
//  LCD ye ait pinin kuruldugu alt program
//------------------------------------------------------------------------------
void The_Pin_Init(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, uint16_t GPIO_clk)
{
    GPIO_InitTypeDef GPIO_InitStructure;
    RCC_AHBPeriphClockCmd(GPIO_clk , ENABLE);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init(GPIOx, &GPIO_InitStructure);
}
//------------------------------------------------------------------------------
//  LCD' pinlerinin kuruldugu alt program
//------------------------------------------------------------------------------
void Lcd_Pin_Init(void)
{
    The_Pin_Init(Lcd_Scl_Port, Lcd_Scl_Pin, Lcd_Scl_Clk);
    The_Pin_Init(Lcd_Si_Port, Lcd_Si_Pin, Lcd_Si_Clk);
    The_Pin_Init(Lcd_A0_Port, Lcd_A0_Pin, Lcd_A0_Clk);
    The_Pin_Init(Lcd_Enb_Port, Lcd_Enb_Pin, Lcd_Enb_Clk);
    The_Pin_Init(Lcd_Rst_Port, Lcd_Rst_Pin, Lcd_Rst_Clk);
    The_Pin_Init(Lcd_BL_Port, Lcd_BL_Pin, Lcd_BL_Clk);
    The_Pin_Init(Lcd_CS_Port, Lcd_CS_Pin, Lcd_CS_Clk);	//<<<<<< Bu pin hem low
    GPIO_SetBits(Lcd_Enb_Port, Lcd_Enb_Pin);
    GPIO_SetBits(Lcd_Rst_Port, Lcd_Rst_Pin);
    GPIO_SetBits(Lcd_BL_Port, Lcd_BL_Pin);
}
//------------------------------------------------------------------------------
//  LCD'ye 1 Bytlýk Komut Gönderen Alt program
//  Altprograma giren argümanlar
//  komut   = Lcd ye gönderilecek komut. MSB --> LSB dogru bit bit gönderilir
//------------------------------------------------------------------------------
void Komut_Gon(uint8_t komut)
{
    uint8_t i, bit = 0x80;
    GPIO_ResetBits(Lcd_A0_Port , Lcd_A0_Pin);     // A0   --> 0
    for(i = 0; i < 8; i++)
    {
        GPIO_ResetBits(Lcd_Si_Port , Lcd_Scl_Pin);    // Scl  --> 0
        if((komut & bit) == bit)
        {
            GPIO_SetBits(Lcd_Si_Port , Lcd_Si_Pin);    // SI   --> 1
        }
        else
        {
            GPIO_ResetBits(Lcd_Scl_Port , Lcd_Si_Pin);    // SI   --> 0
        }
        GPIO_SetBits(Lcd_Scl_Port , Lcd_Scl_Pin);     // SCL  --> 1
        bit >>= 1;
    }
}
//------------------------------------------------------------------------------
//  LCD'nin Alt Ekranýna veya Üst Ekranýna 1 Bytlýk karakter Gönderen Alt program
//  Altprograma giren argümanlar
//  ekrana    = Verilerin nasýl gönderilecegini seçmek için kullanýlýr.Alttaki büyük ekrana
//  gönderilecekse veriler LSB --> MSB ye dogru. Üstteki küçük ekrana gönderilecekse
//  veriler MSB --> LSB ye dogru gönderilir.
//  ekran     = 1 ise alttaki büyük ekrana veri yazýlacak demektir
//  ekran     = 0 ise üstteki küçük ekrana veri yazýlacak demektir
//  veri      = Lcd ye gönderilecek karakter
//------------------------------------------------------------------------------
void Veri_Gon(uint8_t ekran, uint8_t veri) // ekran altaki buyuk ekranamý yoksa ustteki kucuk
{
    // ekranamý yazýlacagýný secer.uste gonderirken byt bilgisi tersden gonderilmeli
    uint8_t i, bit;
    bit = 0x80;               // ekran = 0 ise veriyi MSB--> LSB ye dogru gönder
    if(ekran == 1)
    {
        bit = 0x01;    // ekran = 1 ise veriyi LSB--> MSB ye dogru gönder
    }
    GPIO_SetBits(Lcd_A0_Port , Lcd_A0_Pin);     // A0   --> 1
    for(i = 0; i < 8; i++)
    {
        GPIO_ResetBits(Lcd_Si_Port , Lcd_Scl_Pin);    // Scl  --> 0
        if((veri & bit) == bit)
        {
            GPIO_SetBits(Lcd_Si_Port , Lcd_Si_Pin);    // SI   --> 1
        }
        else
        {
            GPIO_ResetBits(Lcd_Scl_Port , Lcd_Si_Pin);    // SI   --> 0
        }
        GPIO_SetBits(Lcd_Scl_Port , Lcd_Scl_Pin);     // SCL  --> 1
        if(ekran == 1)
        {
            bit <<= 1;
        }
        else
        {
            bit >>= 1;
        }
    }
}
//------------------------------------------------------------------------------
//  LCD'deki Bir Ikonu Yakan/Söndüren Alt program
//  Altprograma giren argümanlar
//  ikon_segment  = Lcd deki yakýlacak veya söndürülecek ikonun segment adresi
//  durum         =1 ise ikon yakýlýr , 0 ise söndürülür.
//------------------------------------------------------------------------------
void Ikon_Durum(uint8_t ikon_segment, uint8_t durum)
{
    Komut_Gon(Ikon_Ekran);  // common olarak ikon page adersinin seçilmesi
    Komut_Gon((ikon_segment & 0x0F));
    ikon_segment = (ikon_segment & 0xF0);
    ikon_segment >>= 4;
    ikon_segment |= 0x10;
    Komut_Gon(ikon_segment);
    Veri_Gon(0, durum);
}
//------------------------------------------------------------------------------
//  LCD'deki Display Cubuklarýndan birini yakmak veya söndürmek için
//  Tarihi_Lcd_Str altprogramýnda kullanýlýr
//  Altprograma giren argümanlar
//  ikon_segment  = Lcd deki yakýlacak veya söndürülecek ikonun segment adresi
//  durum         =1 ise ikon yakýlýr , 0 ise söndürülür.
//------------------------------------------------------------------------------
void Display_Ikon_Durum(uint8_t ikon_segment, uint8_t durum)
{
    Komut_Gon((ikon_segment & 0x0F));
    ikon_segment = (ikon_segment & 0xF0);
    ikon_segment >>= 4;
    ikon_segment |= 0x10;
    Komut_Gon(ikon_segment);
    Veri_Gon(0, durum);
}
//------------------------------------------------------------------------------
//  LCD'nin Secilen Kýsmýný Temizleyen  Alt program
//  Altprograma giren argümanlar
//  commons         = Lcd'nin hangi page adresinin temizlenecegini belirtir
//  segmnets        = Page adresinin kacýncý segement adresinden baslanýlacagý bilgisi
//  segment_sinir   = segment adreslerinden nereye kadar devam edilecegi bilgisi
//------------------------------------------------------------------------------
void Lcd_Clear(uint8_t commons, uint8_t segments, uint8_t segments_sinir)
{
    uint8_t send_segment;
    // commons 0 'dan commons 7 'e kadar secilirse page adress=0xB0 büyük ekran birinci satýr ve küçük ekran
    // commons 8 'dan commons 16 'e kadar secilirse Lcd_Clear=0xB1 ikinci satir
    // commons 17 'den sonrasý Lcd_Clear=0xB8  ikonlarýn satirý
    // ust taraftaki kucuk satirin adresi 0 dan baslamalý

    if(!GPIO_ReadOutputDataBit(Lcd_Enb_Port, Lcd_Enb_Pin)) // Lcd On konumunda  ise
    {
        Komut_Gon(commons);

        do
        {
            send_segment = (segments & 0x0F);
            Komut_Gon(send_segment);
            send_segment = (segments & 0xF0);
            send_segment = send_segment / 16;
            send_segment |= 0x10;
            send_segment &= 0x1F;
            Komut_Gon(send_segment);
            Veri_Gon(1, 0x00);
            segments++;
            if((segments == 16) && (commons == Ikon_Ekran)) // Ikonlar temizlenecekse adres 16dan sonra 47 kadar ikon olmadýgý için
            {
                segments = 47;    // aradaki adrs degerleri atlanýr
            }
        }
        while(segments < segments_sinir);
    }
}
//------------------------------------------------------------------------------
//  LCD ye sabit contrast degeri giren alt program
//------------------------------------------------------------------------------
void Lcd_Contrast(uint8_t value)
{
    Komut_Gon(0x81);            // LCd contranst register
    Komut_Gon(value);
}
//------------------------------------------------------------------------------
//  LCD'ye battarty voltajina ayarli contrast degeri giren alt program
//------------------------------------------------------------------------------
void Lcd_Kontrast_Yenile(void)
{
    Komut_Gon(0x81);            // LCd contranst register

    if(Battery > 345)
    {
        Komut_Gon(0x00);
    }
    else if(Battery > 340)
    {
        Komut_Gon(0x01);
    }
    else if(Battery > 335)
    {
        Komut_Gon(0x02);
    }
    else if(Battery > 325)
    {
        Komut_Gon(0x04);
    }
    else if(Battery > 320)
    {
        Komut_Gon(0x08);
    }
    else if(Battery > 315)
    {
        Komut_Gon(0x10);
    }
    else
    {
        Komut_Gon(0x12);
    }

