coskunergan/isinem_kontrol/src/stm32l1xx_lcd_ST7522.c
}
//------------------------------------------------------------------------------
//  LCD'nin Ayarlarýnýn Yapýldýgý  Alt program
//------------------------------------------------------------------------------
void Lcd_Init(void)
{
    uint8_t *ptr = (uint8_t *)Lcd_Komutlari;
    uint8_t t = 0;

    GPIO_ResetBits(Lcd_Enb_Port, Lcd_Enb_Pin);
    GPIO_ResetBits(Lcd_Rst_Port, Lcd_Rst_Pin);
    while(--t); // ~1mS
    GPIO_SetBits(Lcd_Rst_Port, Lcd_Rst_Pin);
    while(--t); // ~1mS

    do
    {
        Komut_Gon(*ptr);      // Lcd initialize komutlarýný gönder
        ptr++;
    }
    while(*ptr != 0xFF);

    Lcd_Contrast(0x8);
    while(--t); // ~1mS
    Komut_Gon(0xAF);    // LCD On komutu

    //  GPIO_ResetBits(Lcd_BL_Port, Lcd_BL_Pin);        //  Backlight aktif

    Lcd_Clear(Alt_Ekran_1Satir, Ust_Ekran_Baslangic, Alt_Ekran_Bitis); // 0xB0 page adresini temizle (Ust Ekran + Alt Ekran 1. Satýr)
    Lcd_Clear(Alt_Ekran_2Satir, Alt_Ekran_Baslangic, Alt_Ekran_Bitis); // 0xB1 page adresini temizle
    Lcd_Clear(Ikon_Ekran, Ikon_Baslangic, Ikon_Bitis);               // TL - Çizgi -M3 ikonlarýný temizle
}
//------------------------------------------------------------------------------
//  Tabloya Eklenen Türkçe Karakterlerin Görüntülenebilmesi Ýçin  Alt program
//  Altprograma giren argümanlar
//  karakter    = yazýlacak türkçe karakterin Ascii olarak gelen numarasý
//  Altprogramdan dönen argümanlar
//  cevrim      = yazýlacak türkçe karakterin bizim tablomuzdaki sýra numarasý
//------------------------------------------------------------------------------
char TurkceCevir(char karakter)
{
    char cevrim = 0;

    switch(karakter)
    {
        case 0xE7:
            cevrim = 0x7F;
            break;    // ç
        case 0xF0:
            cevrim = 0x80;
            break;    // ð
        case 0xFD:
            cevrim = 0x81;
            break;    // ý
        case 0xF6:
            cevrim = 0x82;
            break;    // ö
        case 0xFE:
            cevrim = 0x83;
            break;    // þ
        case 0xFC:
            cevrim = 0x84;
            break;    // ü
        case 0xC7:
            cevrim = 0x85;
            break;    // Ç
        case 0xD0:
            cevrim = 0x86;
            break;    // Ð
        case 0xDD:
            cevrim = 0x87;
            break;    // Ý
        case 0xD6:
            cevrim = 0x88;
            break;    // Ö
        case 0xDE:
            cevrim = 0x89;
            break;    // Þ
        case 0xDC:
            cevrim = 0x8A;
            break;    // Ü
        case 0xDF:
            cevrim = 0x8B;
            break;    // m3
        case 0xE0:
            cevrim = 0x8C;
            break;    // Su yönü ters oku
        case 0xE1:
            cevrim = 0x8D;
            break;    // Su yönü dogru oku
        case 0xE2:
            cevrim = 0x8E;
            break;    // Rf iþareti
    }
    return cevrim;
}
//------------------------------------------------------------------------------
void Lcd_Center_Str(uint8_t common, const char *text)
{
    uint8_t j, i;
    char buff[15] = "              ";
    uint8_t buff2[15];

    for(i = 0; i < 15; i++)
    {
        buff2[i] = *text;
        text++;
        if(buff2[i] == 0)
        {
            break;
        }
    }

    i = (14 - i) / 2;

    for(j = 0; j < 15; j++)
    {
        if(j >= i)
        {
            buff[j] = buff2[j - i];
        }
        if(buff[j] == 0)
        {
            break;
        }
    }
    buff[j] = ' ';
    for(; j < 15; j++)
    {
        buff[j] = ' ';
    }
    Lcd_Str(common, 0, buff);

}
//------------------------------------------------------------------------------
//  LCD'nin Secilen Kýsmýna Gönderilen Texti Yazan  Alt program
//  Altprograma giren argümanlar
//  commons       = Lcd'nin hangi page adresine yazýlacagýný belirtir
//  start_Adr     = Page adresinin kaçinci karakter adresinden baslanýlacagý bilgisi
//  text          = Ekrana yazýlacka olan tex bilgisi.
//------------------------------------------------------------------------------
void Lcd_Str(uint8_t common, uint8_t start_Adr, const char *text)
{
    uint8_t i = 0, j, send_segment, ekran = 0, segment = 0, say = 0;

    if(common == 1)
    {
        ekran = 1;
        Komut_Gon(Ust_Ekran);
        segment = Ust_Ekran_Baslangic + start_Adr * 6;
        say = 9;
    }
    else if(common == 2)
    {
        ekran = 0;
        Komut_Gon(Alt_Ekran_1Satir);
        segment = Alt_Ekran_Baslangic + start_Adr * 6;
    }
    else if(common == 3)
    {
        ekran = 0;
        Komut_Gon(Alt_Ekran_2Satir);
        segment = Alt_Ekran_Baslangic + start_Adr * 6;
    }

    send_segment = (segment & 0x0F);
    Komut_Gon(send_segment);           // segment adreslerini gonder
    send_segment = (segment & 0xF0);
    send_segment >>= 4;
    send_segment |= 0x10;
    Komut_Gon(send_segment);

    Veri_Gon(ekran, 0);

    while(*text != '\0')
    {
        say++;
        j = *text;
        text++;
        if(j == 0)
        {
            j = 0x20;
        }
        if(126 < j)
        {
            j = TurkceCevir(j);
        }
        j -= 0x20;
        for(i = 0; i < 6; i++)
        {
            Veri_Gon(ekran, Karakter_Tablo[j][i]);    // yazilacak verileri gonder
        }
        if(say > 12)
        {
            break;
        }
    }

}
//-------------------------------------------------
//  LCD'nin Secilen Kýsmýna Gönderilen Texti Yazan  Alt program
//  Altprograma giren argümanlar
//  commons       = Lcd'nin hangi page adresine yazýlacagýný belirtir
//  start_Adr     = Page adresinin kaçinci karakter adresinden baslanýlacagý bilgisi
//  text          = Ekrana yazýlacka olan tex bilgisi.
//------------------------------------------------------------------------------
void Lcd_Invert_Str(uint8_t common, uint8_t start_Adr, const char *text)
{

    uint8_t i = 0, j, send_segment, ekran = 0, segment = 0, say = 0;

    if(common == 1)
    {
        ekran = 1;
        Komut_Gon(Ust_Ekran);
        segment = Ust_Ekran_Baslangic + start_Adr * 6;
        say = 9;
    }
    else if(common == 2)
    {
        ekran = 0;
        Komut_Gon(Alt_Ekran_1Satir);
        segment = Alt_Ekran_Baslangic + start_Adr * 6;
    }
    else if(common == 3)
    {
        ekran = 0;
        Komut_Gon(Alt_Ekran_2Satir);
        segment = Alt_Ekran_Baslangic + start_Adr * 6;
    }

    send_segment = (segment & 0x0F);
    Komut_Gon(send_segment);           // segment adreslerini gonder
    send_segment = (segment & 0xF0);
    send_segment >>= 4;
    send_segment |= 0x10;
    Komut_Gon(send_segment);

    Veri_Gon(ekran, 0xFF);
    while(*text != '\0')
    {
        say++;
        j = *text;
        text++;
        if(j == 0)
        {
            j = 0x20;
        }
        if(126 < j)
        {
            j = TurkceCevir(j);
        }
        j -= 0x20;
        for(i = 0; i < 6; i++)
        {
            Veri_Gon(ekran, ~Karakter_Tablo[j][i]);    // yazilacak verileri gonder
        }
        if(say > 12)
        {
            break;
        }
    }
}
//------------------------------------------------------------------------------
//  LCD'nin Secilen Kýsmýna Gönderilen Texti Yazan  Alt program
//  Altprograma giren argümanlar
//  commons       = Lcd'nin hangi page adresine yazýlacagýný belirtir
//  start_Adr     = Page adresinin kaçinci karakter adresinden baslanýlacagý bilgisi
//  text          = Ekrana yazýlacka olan tex bilgisi.
//------------------------------------------------------------------------------
void Lcd_Underline_Str(uint8_t common, uint8_t start_Adr, const char *text)
{
    uint8_t i = 0, j, send_segment, ekran = 0, segment = 0, say = 0;

    if(common == 1)
    {
        ekran = 1;
        Komut_Gon(Ust_Ekran);
        segment = Ust_Ekran_Baslangic + start_Adr * 6;
        say = 9;
    }
    else if(common == 2)
    {
        ekran = 0;
        Komut_Gon(Alt_Ekran_1Satir);
        segment = Alt_Ekran_Baslangic + start_Adr * 6;
    }
    else if(common == 3)
    {
        ekran = 0;
        Komut_Gon(Alt_Ekran_2Satir);
        segment = Alt_Ekran_Baslangic + start_Adr * 6;
    }

    send_segment = (segment & 0x0F);
    Komut_Gon(send_segment);           // segment adreslerini gonder
    send_segment = (segment & 0xF0);
    send_segment >>= 4;
    send_segment |= 0x10;
    Komut_Gon(send_segment);

    Veri_Gon(ekran, 0x80);

