coskunergan/isinem_kontrol/src/stm32l1xx_lcd_ST7522.c
    while(*text != '\0')
    {
        say++;
        j = *text;
        text++;
        if(j == 0)
        {
            j = 0x20;
        }
        if(126 < j)
        {
            j = TurkceCevir(j);
        }
        j -= 0x20;
        for(i = 0; i < 6; i++)
        {
            Veri_Gon(ekran, Karakter_Tablo[j][i] | 0x80);  // yazilacak verileri gonder
        }
        if(say > 12)
        {
            break;
        }
    }

}
//-------------------------------------------------
void Lcd_Str_Big(const uint8_t *text)
{
    uint8_t i, j, send_segment, segment, say;

    segment = 0;
    say = 0;
    Komut_Gon(Alt_Ekran_1Satir);
    segment = Alt_Ekran_Baslangic;

    send_segment = (segment & 0x0F);
    Komut_Gon(send_segment);           // segment adreslerini gonder
    send_segment = (segment & 0xF0);
    send_segment >>= 4;
    send_segment |= 0x10;
    Komut_Gon(send_segment);

    while(1)
    {
        say++;
        j = *text;
        text++;
        if(j == 'H')
        {
            j = 15;
        }
        else if(j == 'A')
        {
            j = 16;
        }
        else if(j == 'T')
        {
            j = 17;
        }
        else if(j == 'B')
        {
            j = 18;
        }
        else if(j == 'Y')
        {
            j = 19;
        }
        else if(j == 'L')
        {
            j = 20;
        }
        else if(j == 'N')
        {
            j = 21;
        }
        else
        {
            j -= 0x2B;
        }
        for(i = 0; i < 10; i++)
            if(j < 22)
            {
                Veri_Gon(1, Rakam_Tablo_Big_Ust[j][i]);    // yazilacak verileri gonder
            }
            else
            {
                Veri_Gon(1, 0);
            }
        if(say > 12)
        {
            break;
        }
    }

    segment = 0;
    say = 0;
    Komut_Gon(Alt_Ekran_2Satir);
    segment = Alt_Ekran_Baslangic;

    send_segment = (segment & 0x0F);
    Komut_Gon(send_segment);           // segment adreslerini gonder
    send_segment = (segment & 0xF0);
    send_segment >>= 4;
    send_segment |= 0x10;
    Komut_Gon(send_segment);

    text -= 13;

    while(1)
    {
        say++;
        j = *text;
        text++;
        if(j == 'H')
        {
            j = 15;
        }
        else if(j == 'A')
        {
            j = 16;
        }
        else if(j == 'T')
        {
            j = 17;
        }
        else if(j == 'B')
        {
            j = 18;
        }
        else if(j == 'Y')
        {
            j = 19;
        }
        else if(j == 'L')
        {
            j = 20;
        }
        else if(j == 'N')
        {
            j = 21;
        }
        else
        {
            j -= 0x2B;
        }

        for(i = 0; i < 10; i++)
            if(j < 22)
            {
                Veri_Gon(1, Rakam_Tablo_Big_Alt[j][i]);    // yazilacak verileri gonder
            }
            else
            {
                Veri_Gon(1, 0);
            }

        if(say > 12)
        {
            break;
        }
    }
}
//------------------------------------------------------------------------------
//  LCD'nin Display Görünümündeki Kýsmýna Rakam Yazdýran  Alt program
//  Altprograma giren argümanlar
//  rakam       = Displaya yazýlacak rakam
//  display     = Hangi displaya yazýlacagý bilgisi
//------------------------------------------------------------------------------
void Display_Yaz(uint8_t rakam, uint8_t display)
{
    uint8_t *adres_pointer, * rakam_pointer;
    uint8_t	i;
    adres_pointer = (uint8_t *)pointer_display[display]; // kacýncý displaya yazýlacagýný gösteren pointer
    rakam_pointer = (uint8_t *)pointer_rakam[rakam];    // hangi rakamýn yazýlacagýný gösteren pointer
    Komut_Gon(Ikon_Ekran);                                    // displaylarýn yer aldýgý page adresi seçer
    for(i = 0; i < 7; i++)
    {
        Ikon_Durum(*adres_pointer, *rakam_pointer);
        adres_pointer += 1;       // adres pointer arttýr
        rakam_pointer += 1;       // rakam pointer arttýr
    }
}
//------------------------------------------------------------------------------
//  LCD'nin Display Görünümündeki String Halinde rakamlari Yazdýran Alt program
//  Altprograma giren argümanlar
//  ptr       = Displaya yazýlacak rakam stringi
//------------------------------------------------------------------------------
void Display_String_Yaz(char *ptr)
{
    uint8_t i, j;

    for(j = 0; j < 6; j++)
    {
        for(i = 0; i < 7; i++)
        {
            Ikon_Durum(pointer_display[j][i], pointer_rakam[*ptr - 48][i]);
        }
        ptr++;
    }
}



